packages/droneCFD/droneCFD-0.1.3.tar.gz/droneCFD-0.1.3/droneCFD/data/template/0/nuTilda
/*--------------------------------------------------------------------------------*\
 _______  .______        ______   .__   __.  _______      ______  _______  _______
|       \ |   _  \      /  __  \  |  \ |  | |   ____|    /      ||   ____||       \
|  .--.  ||  |_)  |    |  |  |  | |   \|  | |  |__      |  ,----'|  |__   |  .--.  |
|  |  |  ||      /     |  |  |  | |  . `  | |   __|     |  |     |   __|  |  |  |  |
|  '--'  ||  |\  \----.|  `--'  | |  |\   | |  |____    |  `----.|  |     |  '--'  |
|_______/ | _| `._____| \______/  |__| \__| |_______|    \______||__|     |_______/

\*--------------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type fixedValue;
        value $internalField;
    }
    outlet
    {
        type fixedValue;
        value $internalField;
    }
    walls
    {
        type kqRWallFunction;
        value $internalField;
    }

    Aircraft
    {
        type kqRWallFunction;
        value $internalField;
    }
}
